#include<iostream>
using namespace std;

/***************************************************************************
  函数名称：main()
  功    能：主函数
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int main()
{
	int A;  //"营业员 A 偷了手表"
	int B;  //"营业员 B 偷了手表"
	int C;  //"作案不在营业时间"
	int D;  //"提供的证据正确"
	int E;  //"货柜未上锁"
	for (A = 0; A <= 1; A++)
		for (B = 0; B <= 1; B++)
			for (C = 0; C <= 1; C++)
				for (D = 0; D <= 1; D++)
					for (E = 0; E <= 1; E++)
						if ((A || B) && (!A || C) && (!D || E) && (D || !C) && !E)
							cout << "A = " << A << ", B = " << B << endl;
	return 0;
}